[
  {
    "Title": "Full Stack Developer",
    "Company": "ES",
    "Location": "Beirut, Beirut Governorate, Lebanon",
    "Description": "We are looking for a Full Stack Developer to produce scalable software solutions. You'll be part of a cross-functional team that's responsible for the full software development life cycle, from conception to deployment.Work from HomeResponsibilities:Managing the complete software development process from conception to deployment.Maintaining and upgrading the software following deployment.Writing reusable, testable, and efficient code.Designing & developing front end website architecture and user interactions.Overseeing the automated testing and providing feedback to management during thedevelopment process.Designing and developing APIs.Learning and engaging in any new requested web or mobile frameworks.Integration of user-facing elements with server-side logic.Qualifications:Available to start immediatelyFluent in EnglishBachelors degree in Computer Science/Computer Engineering.Minimum 4 years of work experience.Proficiency in HTML, CSS and JavaScript.Proficiency in Java & PHP.Proficiency in MySQL.Familiarity with libraries such as React Js.Familiarity with Amazon Web Services.Strong organizational and project management skills.Excellent verbal communication skills.Good problem-solving skills and attention to detail.Previous experience in building CRM software is a must.",
    "Date": "2024-06-12",
    "Link": "https://lb.linkedin.com/jobs/view/full-stack-developer-at-es-3947254452?position=1&pageNum=0&refId=7iGd4Z2ovjgzgegkOR7cNQ%3D%3D&trackingId=BoXUdHhdazT96HEPWWcMoA%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "Title": "GRADUATE SOFTWARE ENGINEER - Dubai, UAE",
    "Company": "Cobblestone Energy",
    "Location": "Beirut, Beirut Governorate, Lebanon",
    "Description": "Employment type: Full-time & PermanentStarting salary of 55,000 USD per annum in a zero-tax environment (plus biannual performance-based bonuses)Job Location: Dubai, UAE (We provide visa sponsorship & relocation assistance)About Cobblestone EnergyCobblestone Energy is an energy trading company specialising in the Great Britain and European wholesale electricity markets. Founded in 2017, we are part of the next generation of companies defining the future of global commodity trading.We make use of advanced data analytics and extensive research to drive profitable decision making, trading enough electricity every day to power a small country, and growing every day. In doing so, we help to balance the electricity grid, lowering the cost to end consumers, and aiding the transition to a renewable future. Technology and risk management form the backbone of our business.At Cobblestone Energy, we are a diverse team of over 50 people from 20+ nationalities - we believe in hiring extraordinary talent from all around the world. Our flat organizational structure helps us in giving our team members complete ownership of the work and ensures ideas come from every level. We believe in providing unlimited growth opportunities to our people alongside constant feedback and support, which allows us to cover our vulnerabilities and grow as a team in new and interesting ways.Over the years we have grown organically. In light of our further ambitions to be the best in all markets we enter, we would like to welcome talented Software Engineers into our Tech team who have just started their careers and are and looking to take up challenging tasks and being a part of our growth story.Cobblestone Values: Lifelong learning with continuous reflection.Independent thinking through a meritocracy of ideas.The team is more important than the individualBeing the best in any market we enter.Hiring and keeping only the most effective people. Others must benefit from our existence.Job Description At Cobblestone Energy we are on a mission to build the most advanced European electricity trading and analytics platform, with our technology being used by our teams of commercial traders to create significant value. Being a member of our team, you will work on exciting challenges that come with large-scale data processing, automation, and analytics. We work in an agile and highly collaborative environment and challenge the norms of traditional business leadership. We are looking for enthusiastic and resourceful engineers who are passionate about building highly reliable and performance data processing solutions. Developing a strong domain knowledge of our industry over time is key to long term success in this role.This is a rare opportunity to take a leading role in the growth of a major player in the European Power Markets. We are looking for someone who would be committed to the long-term success of the business. We operate in the European Power markets, but our commercial trading operations are in Dubai, UAE.If you have excellent programming skills, strong problem-solving skills and a passion for developing/improving applications utilizing cutting edge technologies, then we would like to meet you.What we offer in this roleA full-time position on our Tech teamCommitted and remarkably talented colleaguesHighly competitive compensation dependent on performanceAn exciting, challenging and fulfilling careerAn opportunity to work on new things from scratch and make independent decisions.Investment in your development to ensure that you always remain the best in businessEquity participation for strong contributors, ensuring our interests are all aligned long termResponsibilitiesBe a key contributor to tech projects critical for commercial operationsWrite software applications and programs for backend/frontend purposesAnalyse programs and apps to improve their features and functionalities in collaboration with the commercial teamsTest & debug programs and fix any reported bugsUphold and live our cultural valuesRequirementsBS/BE in Computer Science/Computer Engineering or related fieldProgramming skills in Python languageFamiliarity & Knowledge in front-end technologies such as HTML5, CSS, JQuery, JS, etcStrong knowledge of REST APIs and webservicesStrong knowledge of Relational Databases (MySQL, PostgreSQL, SQL Server) and SQL languageStrong problem-solving and analytical skillsResilience and a determination to succeedPassionate, self-motivated, and fast learnerDesirable Experience/SkillsKnowledge of at least one popular Python framework (like Django, Flask)Programming skills in JavaKnowledge of NoSQL databasesKnowledge of AWSKnowledge of data visualization tools, mainly Tableau",
    "Date": "2024-06-24",
    "Link": "https://lb.linkedin.com/jobs/view/graduate-software-engineer-dubai-uae-at-cobblestone-energy-3958004171?position=2&pageNum=0&refId=7iGd4Z2ovjgzgegkOR7cNQ%3D%3D&trackingId=w2B3eo%2Fm%2Fy3iTPPfwr%2BcYA%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "Title": "Full Stack Web Developer (Remote)",
    "Company": "Casa Bella Media",
    "Location": "Lebanon",
    "Description": "Full Stack Web DeveloperThe ideal candidate will have strong creativity and a portfolio of work which demonstrates their passion for web developing and web designing. This candidate will have experiences in working with both english and arabic ResponsibilitiesKnow HTML, CSS, JavaScript, PHP and other relevant web design coding languages.Front end and back endDevelop websites for the companyStrong knowledge on WordpressWork with graphics designersTroubleshoot website problemsMaintain and update website on a regular basisMonitor website trafficStay up to date on technologyBasic SEO knowledge could be an added advantage QualificationsBachelor’s Degree in Information Technology, Computer Science, or Computer ApplicationMinimum 3 years of experienceRequire a good knowledge in Web Developing & DesignIf you are qualified, it’s about time to join our team now!Email your CV to career@spaceandplace.ae",
    "Date": "2024-07-03",
    "Link": "https://lb.linkedin.com/jobs/view/full-stack-web-developer-remote-at-casa-bella-media-3965561336?position=6&pageNum=0&refId=7iGd4Z2ovjgzgegkOR7cNQ%3D%3D&trackingId=nstX7TKHCI0TSjGEa8B25A%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "Title": "Web Developer",
    "Company": "Aspire Software",
    "Location": "Beirut, Beirut Governorate, Lebanon",
    "Description": "DescriptionAspire Software is looking for a Web Developer to join our team in Lebanon.Here is a little window into our company: Aspire Software, the operational arm of Valsoft Corp, operates and manages Valsoft’s global portfolio of wholly owned software companies, providing mission-critical solutions across multiple verticals. By implementing industry best practices, Aspire delivers a time sensitive integration process, and the operation of a decentralized model has allowed it to become a hub for creating rapid growth by reinvesting in its portfolio.What You Day Will Look Like Develop, test, and maintain web applications written in Vue.js / Scala Play Framework; Handle end-to-end development, including requirements, research, design , coding, testing, and deployment; Collaborate with product managers, designers, and other stakeholders to identify and clarify technical requirements and ensure product delivery on time; Develop new user-facing features Build reusable code and libraries for future use Ensure the technical feasibility of UI/UX designs Optimize applications for maximum speed and scalability Assure that all user input is validated before submitting to back-end services Collaborate with other team members and stakeholders Develop specifications and designs for complex applications or modifying/maintaining complex existing applications Perform code analysis, requirements analysis, identification of code metrics, system risk analysis, and software reliability analysis Performance tuning, improvement, balancing, usabilityRequirementsKnowledge, Skills, and Abilities Strong communication skills Highly organized Team player Open to learning new frameworks and technologies Previous experience with Agile/SCRUM methodologiesEducation/Experience And Additional Requirements 2+ years of experience in web development with proven experience using two out of three frameworks in an enterprise application: Vue.js, Scala Play framework, Java/JSP frameworks Experience with PostgresSQL or SQL Experience with HTML 5 modern markup and css ... Sass/scss a plus! Experience with workflow in Github source repositories Must be able to work US Eastern Time Zone Hours on a regular basis Must be fluent in English both verbal and written",
    "Link": "https://lb.linkedin.com/jobs/view/web-developer-at-aspire-software-3965456049?position=3&pageNum=0&refId=7iGd4Z2ovjgzgegkOR7cNQ%3D%3D&trackingId=jUwZapCHChEOeHboG3O%2FNQ%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "Title": "Email HTML Developer",
    "Company": "Publicis Groupe",
    "Location": "Beirut, Beirut Governorate, Lebanon",
    "Description": "Creativity has the power to transform human behavior This is the core belief of what we call HumanKind. It's not about advertising or brand propositions or selling products. It's about people and purpose. It's an approach to marketing that serves true human needs, not the other way around. That's why everything we do for brands at Leo Burnett MEA is designed with a human purpose in mind. A brand without purpose is one that will never be understood or embraced by people. A brand with purpose can be a true agent of change and transform the way people think, feel or act. A brand with a true HumanKind purpose can change the world. Our dream is to be the best creator of ideas that truly move people - bar none. Leo Burnett Worldwide, part of Publicis Groupe, is one of the world’s largest agency networks with 96 offices and nearly 10,000 employees. In 2012, the global network was awarded a record-breaking 55 Lions at the Cannes Lions Festival of Creativity and was also named “Network of the Year” by YoungGuns, Dubai Lynx and MENA Cristal Awards. Leo Burnett works with some of the world’s most valuable brands including The Coca-Cola Company, Fiat, Kellogg’s, McDonald’s, Nintendo, P&G, Samsung and Allstate among others. To learn more about Leo Burnett Middle East and North Africa visit leoburnettmea.com, facebook.com/leoburnettmea and follow us via @LeoBurnettMEA on Twitter and Instagram.Job DescriptionWe are seeking a skilled Email HTML Developer to join our dynamic marketing team, focusing on the creation and maintenance of email template. As an Email HTML Developer/Coder, you will be responsible for coding and deploying HTML emails that align with our brand guidelines. Your primary focus will be on creating visually appealing, mobile-responsive, and optimized email campaigns that drive engagement and conversion. The ideal candidate will have a strong background in HTML, CSS, and email marketing, with an understanding of SAP marketing tools and technologies. The role involves collaborating closely with the marketing and design teams to develop responsive, visually appealing, and effective email campaigns that align with our brand guidelines and business objectives.Responsibilities:Develop HTML emails from design concepts, ensuring compatibility across various email clients and devices.Conduct thorough testing of email templates across multiple email clients and devices to ensure quality and consistency. Address any issues related to rendering or functionality.Optimize email templates for responsiveness, load time, and overall performance.Work closely with the marketing, design, and content teams to translate visual designs and marketing strategies into functional email templates.Stay updated with industry best practices, emerging trends, and email marketing standards.Troubleshoot and resolve HTML/CSS issues to ensure flawless rendering across email clients.Provide technical support and troubleshooting for email campaign-related issues.Conduct A/B testing to optimize email campaign performance and deliver actionable insights.Ensure all email campaigns comply with current email regulations and best practices.SAP Marketing Integration: Work with SAP marketing tools and technologies to integrate and optimize email templates within the platform.QualificationsWork schudule is from Sunday to ThursdayProficiency in HTML, CSS, and JavaScript with a focus on email development best practices.Experience with responsive design techniques and frameworks for email.Familiarity with email marketing platforms (SAP) and their respective coding requirements.Strong attention to detail and ability to work in a fast-paced environment with tight deadlines.Previous experience in creating and optimizing email campaigns within an e-commerce or digital marketing environment.Knowledge of email deliverability best practices and CAN-SPAM compliance.Experience with analytics tools to track and analyze email campaign performance.Graphic design skills and proficiency in Adobe Creative Suite or similar design software.Excellent communication skills and a collaborative mindset to work effectively within a team.Bachelor’s degree.Minimum 3 years of work experience",
    "Date": "2024-07-02",
    "Link": "https://lb.linkedin.com/jobs/view/email-html-developer-at-publicis-groupe-3965380303?position=10&pageNum=0&refId=7iGd4Z2ovjgzgegkOR7cNQ%3D%3D&trackingId=Iem4jjecYcs3F1c5klGdLg%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "Title": "Web Developer",
    "Company": "Canonical",
    "Location": "Beirut, Beirut Governorate, Lebanon",
    "Description": "Our mission is great open sourceIt is our mission to make open source software available to people everywhere. We create world-renowned software, impacting the lives of millions of people every day.The web team works in a multi-disciplinary environment with visual designers, UX designers and other developers to bring exciting new web projects to life. We help and learn from each other and constantly strive to improve both our work and our processes.Required Skills And ExperienceDemonstrable experience of work on modern web applicationsA strong understanding of HTML, CSS with SCSS and JavaScriptExperience with Javascript components librariesExperience with TypeScriptExperience with responsive user interfaces for a wide range of devices and browsersExperience with Git or other version control systemsAwareness of SEO best practiceConsideration of accessibility in all aspects of your workA strong understanding of web performance in complex user interfacesAbility to interact with UX, designers and server-side developersCuriosity about technology and a thirst to learnBased in EMEA timezones (Europe, the Middle East and Africa)University degree or equivalent educationUseful experience if you have itFamiliarity with Linux desktop technologiesServer-side languages, such as Python or NodeJSExperience working on a large scale React (with TypeScript) projectA history of open source contributionsRelevant work experienceWho you areWe want a Web Developer who loves what they do. You are passionate about web standards and keep abreast of new developments in our industry. You always look for opportunities to improve your skills. You like to show off what you're working on and also learn from others. You have strong attention to detail and value the design of a product as much as you value the code. You have strong communication skills and maybe even blog once in a while. You're aware of the latest CSS techniques but also know the limitations that developing for a broad audience can bring - actually, you embrace the challenge.In this teamYou'll create high fidelity websites and web apps using the latest incarnations of HTML, CSS (SCSS) and Javascript (React and TypeScript)You'll help maintain existing projects including updating content and adding new pagesYou'll manage incoming requests for updates and liaise with or delegate to other people as necessaryYou'll ensure the standard of our output remains high and consistent across our whole product portfolioYou'll ensure new pages are published according to specification and in compliance with our web style guideYou'll participate in and contribute to our living style guide, Vanilla Framework.Work closely with UX designers and visual designers to implement exemplary user experiences.What we offerAn opportunity to help shape a company and products with a strong influence in the open source communityAn inclusive work environment within a team of friendly people with a broad range of skill sets, from UX designers to copywritersLearning and developmentAnnual compensation reviewRecognition rewardsAnnual leavePriority Pass for travelWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity we will give your application fair consideration.",
    "Date": "2024-06-26",
    "Link": "https://lb.linkedin.com/jobs/view/web-developer-at-canonical-3959704629?position=8&pageNum=0&refId=7iGd4Z2ovjgzgegkOR7cNQ%3D%3D&trackingId=7XLDOHlcL%2FBcusk6%2FUaEvQ%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "Title": "Front-End Engineer",
    "Company": "ES",
    "Location": "Beirut, Beirut Governorate, Lebanon",
    "Description": "Seeking a highly skilled and motivated Front-End Engineer to join a dynamic team remotely. In this role, you will work closely with back-end developers and designers to bring UI/UX mockups to life, develop reusable components, and ensure our AI-powered platform delivers an exceptional user experience across all devices. If you excel in crafting high-quality, maintainable code and thrive in a collaborative environment, we want to hear from you!Responsibilities:Collaborate with back-end developers and designers to translate UI/UX mockups and prototypes into clean, maintainable, and responsive front-end code.Develop reusable UI components and libraries to ensure consistency and efficiency across the application.Implement high-quality, pixel-perfect front-end features using (Angular+ Framework in a Microservices environment).Optimize web applications for performance across different devices and browsers.Write clean, well-documented, and maintainable code according to best practices.Conduct code reviews and mentor junior developers, fostering a collaborative and learning-oriented environment.Stay up-to-date on the latest front-end technologies and trends.Troubleshoot and debug complex front-end issues.Basic Qualifications:Bachelor's degree in Computer Science, Information Technology, or a related field (or equivalent experience).6+ years of experience in front-end application development & design including HTML5, CSS3, and JavaScript is a must.3+ years of experience in Angular-based Framework applications (Angular latest Versions)2+ years of experience in Node JS.Hands-on experience in the integration of the API.Experience and strong understanding of CI/CD principles using tools like GitHub.Experience with responsive web design (RWD) and mobile.Excellent problem-solving and debugging skills.Strong communication and collaboration skills.Ability to work independently and manage multiple tasks effectively.A passion for building high-quality, user-friendly web experiences.Preferred Qualifications:Experience with accessibility best practices (WCAG).Experience with performance optimization techniques.Experience with unit testing and front-end build tools.Experience with a UI/UX design tool (ex: Figma, Sketch).Experience in NestJS Framework.",
    "Date": "2024-06-12",
    "Link": "https://lb.linkedin.com/jobs/view/front-end-engineer-at-es-3947253495?position=4&pageNum=0&refId=7iGd4Z2ovjgzgegkOR7cNQ%3D%3D&trackingId=%2FwMMwKhuJq4cIkcKh9JolA%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "Title": "Software Developer",
    "Company": "Aspire Software",
    "Location": "Beirut, Beirut Governorate, Lebanon",
    "Description": "DescriptionAspire Software is looking for a Software Developer to join our team in Lebanon.Here is a little window into our company: Aspire Software, the operational arm of Valsoft Corp, operates and manages Valsoft’s global portfolio of wholly owned software companies, providing mission-critical solutions across multiple verticals. By implementing industry best practices, Aspire delivers a time sensitive integration process, and the operation of a decentralized model has allowed it to become a hub for creating rapid growth by reinvesting in its portfolio.Description Du Poste Ton rôle chez Progitek : Créer, développer, tester et entretenir divers logiciels pour les clients de Progitek (projets from Scratch) Participer à la transition On Premise vers un mode SaaS (logiciels tournés \"client - serveur\") Utiliser des technologies cloud AWS Assurer un développement backend (Golang) et frontend (Vue.js) Intégrer une architecture REST.API propre garantissant une bonne interopérabilité avec les serveurs Participer à des projets communs de programmation / développement Technos recherchées / utilisées : Langage de programmation TypeScript; Expérience significative dans le développement frontend Expérience dans le développement backend Connaissance de REST API; C'est un atout pour nous si tu connais : Technologies Serverless AWS Vue.js Golang Postgress Containeur DockerRequirements Un diplôme universitaire ou collégial en informatique et toute combinaison d'expérience pertinente sera considérée, Être passionné de la programmation et ne pas avoir peur d'apprendre de nouvelles choses, Aimer travailler sur des projets complets tout en apportant ta créativité.",
    "Link": "https://lb.linkedin.com/jobs/view/software-developer-at-aspire-software-3965454515?position=7&pageNum=0&refId=7iGd4Z2ovjgzgegkOR7cNQ%3D%3D&trackingId=m1%2F9WmeuNrH8cbKtoyqolg%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "Title": "Full Stack Developer (MERN)",
    "Company": "AudaCity Capital Management",
    "Location": "Lebanon",
    "Description": "AudaCity Capital is a progressive and flourishing prop trading firm, and trading education provider. We are based in London, and at the moment have a team of highly trained properly trading professionals, managing the company’s extensive funds on our City of London based trading floor.We believe that the only way to be a winner in our industry is to invest heavily in talented people who want to grow with us. We are seeking like-minded professionals to develop their skills and enable them to join our team.We trade on all major asset classes on multiple exchanges with our own capital and do not handle any client funds or have customers. By becoming a member of the team, you become part of our success. We are market leaders because we have always had an internal vision to promote a strong entrepreneurial working culture.Our mission statement is to mix a strong base of intellectual capital with state-of-the-art technology, to build for the future. Our trading has a unique combination of skills, talent, and industry-leading software, which has been produced in-house by the company development department.Strict, Prudent Risk ManagementYou can have guts, but not glory, if you don’t back your trading moves with proper management practices. That’s why we treat risk management with the utmost seriousness …The RoleYou Will Be Responsible ForGenerating IT budget in conjunction with other stake holders.Managing overall IT operations ranging from infrastructure to application.Managing day-to-day stakeholder interaction, identifying needs and evaluating solutions.Working with other internal stakeholders as well as third party vendors to ensure solutions are in line with current & future business requirements.Ideal ProfileYou possess a Degree/Diploma in Computer Science, Engineering or related field.You have at least 3 years experience, ideally within a IT Manager / IT Director / CTO role.You have strong communication and interpersonal skills and a solid track record in IT business partnering roles and driving technology initiatives and programmes across the business.You have working knowledge of ExpressYou pay strong attention to detail and deliver work that is of a high standardYou are highly goal driven and work well in fast paced environmentsYou possess strong analytical skills and are comfortable dealing with numerical dataWhat's on Offer?Work alongside & learn from best in class talentJoin a well known brand within Brokerage / Treasury / Securities ExchangeGreat work environment",
    "Date": "2024-07-01",
    "Link": "https://lb.linkedin.com/jobs/view/full-stack-developer-mern-at-audacity-capital-management-3962705903?position=5&pageNum=0&refId=7iGd4Z2ovjgzgegkOR7cNQ%3D%3D&trackingId=sEC7S5ZNVBv%2BTwUUop5emA%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "Title": "Full Stack Developer",
    "Company": "Khatib & Alami",
    "Location": "Beirut Governorate, Lebanon",
    "Description": "In this dynamic role, you will play a key role in shaping and guiding our application development initiatives, contributing to the growth and success of our team. Your expertise will be instrumental in steering projects, fostering innovation, and ensuring the delivery of high-quality solutions.Join us at the forefront of digital excellence – apply now and be a driving force in transforming the landscape of technology!The job holder will be leading the following;Designing, developing, and modifying modules based on functional and system requirements designsContributes to the verification of the Business Requirements documents, and the development of Database, Application Design, and installation documentationReceives programming tasks related to complex application functionality from a Requirements Specification document, then develops the code and translates the logic into a programming languageReviews code written by others, combines all the fragmented code together, and tests the complete functionalityMonitor progress towards project deliverables under their jurisdiction together with the Project Manager and take all necessary steps to ensure on-time deliveryWorking closely with the Development Team and the Project Manager to understand the functional and systems requirementsParticipating in the testing process through unit testing and bug fixesParticipate and provide internal feedback on lessons learned through a project’s deliveryParticipating in internal capacity-building workshopsQualifications, Skills, and Experience Required to Execute this RoleBachelor’s Degree in Computer Science, Computer Engineering, or Management Information Systems3+ years of professional experience in a software development functionSolid knowledge of Python and DjangoExpertise in relational database systems like PostgreSQL or MySQLExperience with frontend frameworks like Vue.js and ReactDemonstrated skill in creating pixel-perfect and responsive interfaces using (S)CSSExperience with tools like Docker, GIT, Webpack, SCSS, NGINX, pytest, Redis, Celery, and ESLintGood communication and presentation skillsGood interpersonal skillsProficiency in spoken and written English and Arabic",
    "Date": "2024-06-26",
    "Link": "https://lb.linkedin.com/jobs/view/full-stack-developer-at-khatib-alami-3960386056?position=9&pageNum=0&refId=7iGd4Z2ovjgzgegkOR7cNQ%3D%3D&trackingId=6HglyMX%2BVU7qi%2Bd2KPCqGA%3D%3D&trk=public_jobs_jserp-result_search-card"
  }
]